package com.MainAcademy.Petrick;

/*
Домашнее задание №1
студента Петрик Андрея petrickandrew@gmail.com
по курсу "Атоматизированного тестирования" Main Academy
проверяющий Генадий Мирошниченко.

Задание:
  Объявить переменную name типа String.
 Сразу же в строке объявления присвоить ей какое-нибудь значение.
 Выведи на экран переменную name.

 */
public class HomeTask {
    public static void main(String[] args) {
        String name = "Поехали!", gagarin="       Юрий Гагарин.", str = "\u2122" ;

        System.out.println(name);
        System.out.print(gagarin);
        System.out.print(str);
    }
}


